cmsis-svd/cmsis-svd/data/Atmel/ATSAME70N20B.svd
            <register>
               <name>PIO_DRIVER</name>
               <description>I/O Drive Register</description>
               <addressOffset>0x0118</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LINE0</name>
                     <description>Drive of PIO Line 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE0Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE1</name>
                     <description>Drive of PIO Line 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE1Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE2</name>
                     <description>Drive of PIO Line 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE2Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE3</name>
                     <description>Drive of PIO Line 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE3Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE4</name>
                     <description>Drive of PIO Line 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE4Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE5</name>
                     <description>Drive of PIO Line 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE5Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE6</name>
                     <description>Drive of PIO Line 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE6Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE7</name>
                     <description>Drive of PIO Line 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE7Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE8</name>
                     <description>Drive of PIO Line 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE8Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE9</name>
                     <description>Drive of PIO Line 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE9Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE10</name>
                     <description>Drive of PIO Line 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE10Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE11</name>
                     <description>Drive of PIO Line 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE11Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE12</name>
                     <description>Drive of PIO Line 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE12Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE13</name>
                     <description>Drive of PIO Line 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE13Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE14</name>
                     <description>Drive of PIO Line 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE14Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE15</name>
                     <description>Drive of PIO Line 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE15Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE16</name>
                     <description>Drive of PIO Line 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE16Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE17</name>
                     <description>Drive of PIO Line 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE17Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE18</name>
                     <description>Drive of PIO Line 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE18Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE19</name>
                     <description>Drive of PIO Line 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE19Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE20</name>
                     <description>Drive of PIO Line 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE20Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE21</name>
                     <description>Drive of PIO Line 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE21Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE22</name>
                     <description>Drive of PIO Line 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE22Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE23</name>
                     <description>Drive of PIO Line 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE23Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE24</name>
                     <description>Drive of PIO Line 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE24Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE25</name>
                     <description>Drive of PIO Line 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE25Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE26</name>
                     <description>Drive of PIO Line 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE26Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE27</name>
